literate-programming-with-org/index.org
#+title: Literate Programming with Org Mode
#+subtitle: Broke: Generate docs from code | Woke: Generate code from docs 😎
#+date: 12 August 2022
#+options: toc:nil num:nil html-style:nil html5-fancy:'t title:nil exports:both
#+html_content_class: container
#+html_head: <link rel="stylesheet" href="../style.css">
#+html_head: <meta charset="utf-8">
#+html_head:<meta http-equiv="X-UA-Compatible" content="IE=edge">
#+html_head:<meta name="viewport" content="width=device-width, initial-scale=1">
#+html_head:<link rel="apple-touch-icon" sizes="180x180" href="../apple-touch-icon.png">
#+html_head:<link rel="icon" type="image/png" sizes="32x32" href="../favicon-32x32.png">
#+html_head:<link rel="icon" type="image/png" sizes="16x16" href="../favicon-16x16.png">

Recently I've been writing [[https://docs.microsoft.com/en-us/azure/azure-resource-manager/bicep/overview?tabs=bicep][bicep]] for provisioning Azure services, the intent was to create a reusable template that could provision
different services for different projects. Having never worked with bicep before I wanted to ensure I wrote good documentation that I
could refer back to later, and decided to try out [[https://orgmode.org/][Org Mode]] for its literate programming features to ensure that I kept the documentation
in sync with the code.

* Structured Code

Basic org syntax is a lot like markdown but using different special characters (=/= for italics instead of =_= etc) but a more significant
difference is the approach of using structural blocks for source code. Markdown uses =```= to denote a block of code, and some
processors (like github's) can take a language argument (e.g. =``` csharp=) to provide syntax highlighting. Org uses comparitively
clunky looking =#+begin_src= and =#+end_src= markers to surround code blocks, but it provides a much richer feature set for them.

Code blocks take a language parameter just like the one some markdown processors provide, but within emacs this provides access to
features from the language mode that you would use when editing a file of that type like syntax highlighting and autocompletion. 😀

* Execution

For some languages, it is also possible to execute the code directly inside the org file and have any output placed in a results block
similar to [[https://jupyter.org/try-jupyter/lab/][Jupyter Notebooks]].

A javascript block with this header line:

#+begin_src org
,#+begin_src js :results output replace :wrap src json
#+end_src

And this javascript code:

#+name: js-sample
#+begin_src js :results output replace :wrap src json :exports both
fetch('https://jsonplaceholder.typicode.com/todos/2')
  .then(x => x.json())
  .then(x => console.log(x));
#+end_src

Executing that code block will output a results section that wraps the result in a json source block:

#+RESULTS: js-sample
#+begin_src json
{
  userId: 1,
  id: 2,
  title: 'quis ut nam facilis et officia qui',
  completed: false
}
#+end_src


But code in org files isn't limited to staying within the file, with =org-babel-tangle= you can create code files from your documentation.

