literate-programming-with-org/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-12 Fri 17:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate Programming with Org Mode 🦄</title>
<meta name="author" content="Adam Guest" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css">
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="apple-touch-icon" sizes="180x180" href="../apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="../favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="../favicon-16x16.png">
<meta property="og:url" content="https://chamook.lol/literate-programming-with-org/" />
<meta property="og:image" content="https://chamook.lol/literate-programming-with-org/card.png" />
<meta property="og:type" content="article" />
<meta property="article:published_time" content="2022-08-12T00:00:00+00:00" />
<meta name="twitter:card" content="summary_large_image" />
<meta property="twitter:image" content="https://chamook.lol/literate-programming-with-org/card.png" />
<meta property="twitter:title" content="Literate Programming with Org Mode 🦄" />
<meta property="twitter:description" content="Broke: Generate docs from code | Woke: Generate code from docs 😎" />
</head>
<body>
<div id="preamble" class="status">
<header>
<div class="container">
  <h1 class="glitch-text" data-text="Literate Programming with Org Mode 🦄">Literate Programming with Org Mode 🦄</h1>
  <span class="subtitle">Broke: Generate docs from code | Woke: Generate code from docs 😎</span>
</div>
<div class="byline">
  <div class="container">
    <p>By <a href="https://twitter.com/chamooktweets">Adam Guest</a> - 12 August 2022</p>
  </div>
</div>
</header>
</div>
<div id="content" class="container">
<p>
Recently I've been writing <a href="https://docs.microsoft.com/en-us/azure/azure-resource-manager/bicep/overview?tabs=bicep">bicep</a> for provisioning Azure services, the intent was to create a reusable template that could provision
different services for different projects. Having never worked with bicep before I wanted to ensure I wrote good documentation that I
could refer back to later, and decided to try out <a href="https://orgmode.org/">Org Mode</a> for its literate programming features to ensure that I kept the documentation
in sync with the code.
</p>

<div id="outline-container-org2e9ad86" class="outline-2">
<h2 id="org2e9ad86">Structured Code</h2>
<div class="outline-text-2" id="text-org2e9ad86">
<p>
Basic org syntax is a lot like markdown but using different special characters (<code>/</code> for italics instead of <code>_</code> etc) but a more significant
difference is the approach of using structural blocks for source code. Markdown uses <code>```</code> to denote a block of code, and some
processors (like github's) can take a language argument (e.g. <code>``` csharp</code>) to provide syntax highlighting. Org uses comparitively
clunky looking <code>#+begin_src</code> and <code>#+end_src</code> markers to surround code blocks, but it provides a much richer feature set for them.
</p>

<p>
Code blocks take a language parameter just like the one some markdown processors provide, but within emacs this provides access to
features from the language mode that you would use when editing a file of that type like syntax highlighting and autocompletion. 😀
</p>
</div>
</div>

<div id="outline-container-orgcd16a31" class="outline-2">
<h2 id="orgcd16a31">Execution</h2>
<div class="outline-text-2" id="text-orgcd16a31">
<p>
For some languages, it is also possible to execute the code directly inside the org file and have any output placed in a results block
similar to <a href="https://jupyter.org/try-jupyter/lab/">Jupyter Notebooks</a>.
</p>

<p>
A javascript block with this header line:
</p>

<div class="org-src-container">
<pre class="src src-org">#+begin_src js :results output replace :wrap src json
</pre>
</div>

<p>
And this javascript code:
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgd48066c">fetch<span style="color: #8b0000;">(</span><span style="color: #61CE3C;">'https://jsonplaceholder.typicode.com/todos/2'</span><span style="color: #8b0000;">)</span>
  .then<span style="color: #8b0000;">(</span>x =&gt; x.json<span style="color: #006400;">()</span><span style="color: #8b0000;">)</span>
  .then<span style="color: #8b0000;">(</span>x =&gt; console.log<span style="color: #006400;">(</span>x<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>;
</pre>
</div>

<p>
Executing that code block will output a results section that wraps the result in a json source block:
</p>

<div class="org-src-container">
<pre class="src src-json"><span style="color: #8b0000;">{</span>
  userId: <span style="color: #96CBFE;">1</span>,
  id: <span style="color: #96CBFE;">2</span>,
  title: 'quis ut nam facilis et officia qui',
  completed: <span style="color: #96CBFE;">false</span>
<span style="color: #8b0000;">}</span>
</pre>
</div>


<p>
But code in org files isn't limited to staying within the file, with <code>org-babel-tangle</code> you can create code files from your documentation.
</p>
</div>
</div>
