literate-programming-with-org/index.org
* Tangling

By adding =:tangle= and a filename to the start of a block, you can output code from an org documentation file into a file that only
contains code, and can even be part of a whole coding project.

Using =M-x org-babel-tangle= from within emacs on a file containing a block like this:

#+begin_src org

,#+begin_src csharp :tangle SampleClass.cs
namespace Chamook.Sample;

public sealed class SampleClass
{
    public string Name { get; }

    public void Greet() => Console.WriteLine($"Hello, {Name}");
}

,#+end_src
#+end_src

Will output a file called =SampleClass.cs= with the code as contents:

#+begin_src csharp
namespace Chamook.Sample;

public sealed class SampleClass
{
    public string Name { get; }

    public void Greet() => Console.WriteLine($"Hello, {Name}");
}
#+end_src

This can be broken up across several source blocks and tangled to a single file:

#+begin_src org
First declare a namespace:

,#+begin_src csharp :tangle SampleClass.cs
namespace Chamook.Sample;
,#+end_src

Then declare the class:
,#+begin_src csharp :tangle SampleClass.cs
public sealed class SampleClass
{
    public string Name { get; }

    public void Greet() => Console.WriteLine($"Hello, {Name}");
}
,#+end_src
#+end_src

Will tangle to a single =SampleClass.cs= file containing code from all the source blocks that tangle to it in the order that they appear in the
org file.

One org file can also tangle to multiple code files by specifying different filenames in code blocks:

#+begin_src org
Namespace for my C# file:

,#+begin_src csharp :tangle SampleClass.cs
namespace Chamook.Sample;
,#+end_src

Oh that reminds me of a funny javascript story:

,#+begin_src js :tangle hahaha.js
function pleaseLaugh() {
  return "hahaha";
}
,#+end_src

Then declare a class in the C# file:

,#+begin_src csharp :tangle SampleClass.cs
public sealed class SampleClass
{
    public string Name { get; }

    public void Greet() => Console.WriteLine($"Hello, {Name}");
}
,#+end_src
#+end_src

Will output both the =.cs= and the =.js= files specified.

* Conditional Tangling

For the templates I was creating from an org file, I wanted to be able to pick and choose which parts were included rather than just
outputting everything. Conveniently emacs can evaluate an emacs-lisp expression as part of the =:tangle= definition on a code block,
meaning that I could check a condition and either return a filename or ="no"= which disables tangling for that block. The check
could look at variables set within the org file, but as I was working on a template that other people might want to use I made it check
if some dotfiles existed in the same directory:

#+begin_src org
,#+begin_src bicep :tangle (if (file-exists-p ".Config1") "infra/main.bicep" "no")
#+end_src

This block will only be tangled with the =main.bicep= file if there is a file called =.Config1= in the same directory as the org file.

