literate-programming-with-org/index.html

<div id="outline-container-org80a784f" class="outline-2">
<h2 id="org80a784f">Tangling</h2>
<div class="outline-text-2" id="text-org80a784f">
<p>
By adding <code>:tangle</code> and a filename to the start of a block, you can output code from an org documentation file into a file that only
contains code, and can even be part of a whole coding project.
</p>

<p>
Using <code>M-x org-babel-tangle</code> from within emacs on a file containing a block like this:
</p>

<div class="org-src-container">
<pre class="src src-org">
<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src csharp :tangle SampleClass.cs</span>
<span style="color: #4c83ff; background-color: #383838;">namespace</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Chamook</span><span style="background-color: #383838;">.</span><span style="color: #ff69b4; background-color: #383838;">Sample</span><span style="background-color: #383838;">;</span>

<span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">sealed</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">class</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">SampleClass</span>
<span style="color: #8b0000; background-color: #383838;">{</span>
<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">string</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Name</span><span style="background-color: #383838;"> </span><span style="color: #006400; background-color: #383838;">{</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">get</span><span style="background-color: #383838;">; </span><span style="color: #006400; background-color: #383838;">}</span>

<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">void</span><span style="background-color: #383838;"> </span><span style="color: #ff1493; background-color: #383838;">Greet</span><span style="color: #006400; background-color: #383838;">()</span><span style="background-color: #383838;"> =&gt; Console.</span><span style="color: #ff1493; background-color: #383838;">WriteLine</span><span style="color: #006400; background-color: #383838;">(</span><span style="background-color: #383838;">$</span><span style="color: #61CE3C; background-color: #383838;">"Hello, {Name}"</span><span style="color: #006400; background-color: #383838;">)</span><span style="background-color: #383838;">;</span>
<span style="color: #8b0000; background-color: #383838;">}</span>

<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>

<p>
Will output a file called <code>SampleClass.cs</code> with the code as contents:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #4c83ff;">namespace</span> <span style="color: #ff69b4;">Chamook</span>.<span style="color: #ff69b4;">Sample</span>;

<span style="color: #4c83ff;">public</span> <span style="color: #4c83ff;">sealed</span> <span style="color: #4c83ff;">class</span> <span style="color: #afd8af;">SampleClass</span>
<span style="color: #8b0000;">{</span>
    <span style="color: #4c83ff;">public</span> <span style="color: #afd8af;">string</span> <span style="color: #ff69b4;">Name</span> <span style="color: #006400;">{</span> <span style="color: #4c83ff;">get</span>; <span style="color: #006400;">}</span>

    <span style="color: #4c83ff;">public</span> <span style="color: #afd8af;">void</span> <span style="color: #ff1493;">Greet</span><span style="color: #006400;">()</span> =&gt; Console.<span style="color: #ff1493;">WriteLine</span><span style="color: #006400;">(</span>$<span style="color: #61CE3C;">"Hello, {Name}"</span><span style="color: #006400;">)</span>;
<span style="color: #8b0000;">}</span>
</pre>
</div>

<p>
This can be broken up across several source blocks and tangled to a single file:
</p>

<div class="org-src-container">
<pre class="src src-org">First declare a namespace:

<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src csharp :tangle SampleClass.cs</span>
<span style="color: #4c83ff; background-color: #383838;">namespace</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Chamook</span><span style="background-color: #383838;">.</span><span style="color: #ff69b4; background-color: #383838;">Sample</span><span style="background-color: #383838;">;</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>

Then declare the class:
<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src csharp :tangle SampleClass.cs</span>
<span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">sealed</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">class</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">SampleClass</span>
<span style="color: #8b0000; background-color: #383838;">{</span>
<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">string</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Name</span><span style="background-color: #383838;"> </span><span style="color: #006400; background-color: #383838;">{</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">get</span><span style="background-color: #383838;">; </span><span style="color: #006400; background-color: #383838;">}</span>

<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">void</span><span style="background-color: #383838;"> </span><span style="color: #ff1493; background-color: #383838;">Greet</span><span style="color: #006400; background-color: #383838;">()</span><span style="background-color: #383838;"> =&gt; Console.</span><span style="color: #ff1493; background-color: #383838;">WriteLine</span><span style="color: #006400; background-color: #383838;">(</span><span style="background-color: #383838;">$</span><span style="color: #61CE3C; background-color: #383838;">"Hello, {Name}"</span><span style="color: #006400; background-color: #383838;">)</span><span style="background-color: #383838;">;</span>
<span style="color: #8b0000; background-color: #383838;">}</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>

<p>
Will tangle to a single <code>SampleClass.cs</code> file containing code from all the source blocks that tangle to it in the order that they appear in the
org file.
</p>

<p>
One org file can also tangle to multiple code files by specifying different filenames in code blocks:
</p>

<div class="org-src-container">
<pre class="src src-org">Namespace for my C# file:

<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src csharp :tangle SampleClass.cs</span>
<span style="color: #4c83ff; background-color: #383838;">namespace</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Chamook</span><span style="background-color: #383838;">.</span><span style="color: #ff69b4; background-color: #383838;">Sample</span><span style="background-color: #383838;">;</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>

Oh that reminds me of a funny javascript story:

<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src js :tangle hahaha.js</span>
<span style="color: #4c83ff; background-color: #383838;">function</span><span style="background-color: #383838;"> </span><span style="color: #ff1493; background-color: #383838;">pleaseLaugh</span><span style="color: #8b0000; background-color: #383838;">()</span><span style="background-color: #383838;"> </span><span style="color: #8b0000; background-color: #383838;">{</span>
<span style="background-color: #383838;">  </span><span style="color: #4c83ff; background-color: #383838;">return</span><span style="background-color: #383838;"> </span><span style="color: #61CE3C; background-color: #383838;">"hahaha"</span><span style="background-color: #383838;">;</span>
<span style="color: #8b0000; background-color: #383838;">}</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>

Then declare a class in the C# file:

<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src csharp :tangle SampleClass.cs</span>
<span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">sealed</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">class</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">SampleClass</span>
<span style="color: #8b0000; background-color: #383838;">{</span>
<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">string</span><span style="background-color: #383838;"> </span><span style="color: #ff69b4; background-color: #383838;">Name</span><span style="background-color: #383838;"> </span><span style="color: #006400; background-color: #383838;">{</span><span style="background-color: #383838;"> </span><span style="color: #4c83ff; background-color: #383838;">get</span><span style="background-color: #383838;">; </span><span style="color: #006400; background-color: #383838;">}</span>

<span style="background-color: #383838;">    </span><span style="color: #4c83ff; background-color: #383838;">public</span><span style="background-color: #383838;"> </span><span style="color: #afd8af; background-color: #383838;">void</span><span style="background-color: #383838;"> </span><span style="color: #ff1493; background-color: #383838;">Greet</span><span style="color: #006400; background-color: #383838;">()</span><span style="background-color: #383838;"> =&gt; Console.</span><span style="color: #ff1493; background-color: #383838;">WriteLine</span><span style="color: #006400; background-color: #383838;">(</span><span style="background-color: #383838;">$</span><span style="color: #61CE3C; background-color: #383838;">"Hello, {Name}"</span><span style="color: #006400; background-color: #383838;">)</span><span style="background-color: #383838;">;</span>
<span style="color: #8b0000; background-color: #383838;">}</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>

<p>
Will output both the <code>.cs</code> and the <code>.js</code> files specified.
</p>
</div>
</div>

<div id="outline-container-org2b58f0e" class="outline-2">
<h2 id="org2b58f0e">Conditional Tangling</h2>
<div class="outline-text-2" id="text-org2b58f0e">
<p>
For the templates I was creating from an org file, I wanted to be able to pick and choose which parts were included rather than just
outputting everything. Conveniently emacs can evaluate an emacs-lisp expression as part of the <code>:tangle</code> definition on a code block,
meaning that I could check a condition and either return a filename or <code>"no"</code> which disables tangling for that block. The check
could look at variables set within the org file, but as I was working on a template that other people might want to use I made it check
if some dotfiles existed in the same directory:
</p>

<div class="org-src-container">
<pre class="src src-org">#+begin_src bicep :tangle (if (file-exists-p ".Config1") "infra/main.bicep" "no")
</pre>
</div>

<p>
This block will only be tangled with the <code>main.bicep</code> file if there is a file called <code>.Config1</code> in the same directory as the org file.
</p>
</div>
</div>
