literate-programming-with-org/index.org
* Backfilling Values with Noweb

Building templates that were configurable in this way led to a scenario where sometimes I would need to include values in an earlier part of a
bicep file only if a later block was tangled. Source blocks in org mode support using [[https://en.wikipedia.org/wiki/Noweb][noweb]] style markup to include either the contents
or the result of evaluating other blocks in the document, which provides a nice way of solving this problem.

In the initial block that may need a value from later, I can enable noweb replacements by specifying =:noweb yes= and then add a
reference to the later contents:

#+begin_src org
,#+begin_src :noweb yes
<<maybe-from-later()>>
,#+end_src
#+end_src

Then later include a named block, that performs the check for the dotfile and returns a value if it is present, or an empty string otherwise:

#+begin_src org
#name: maybe-from-later
,#+begin_src emacs-lisp :cache no
(if (file-exists-p ".config2") "// the file exists" "")
,#+end_src
#+end_src

* Tangling for the non-Emacs user

A template is less useful if it constrains people to use a specific editor (with a relatively steep learning curve) to be able to get any value from
it, but fortunately Emacs can be called from the command line to tangle a file so I included a shell script with my template. (I actually tangled
the shell script from the template itself 🤘):

#+begin_src org
,#+begin_src bash :tangle tangle.sh :shebang "#!/bin/bash"
emacs --batch \
      --eval "(require 'org)" \
      --eval "(setq org-confirm-babel-evaluate nil)" \
      --eval '(org-babel-tangle-file "file.org")'
,#+end_src
#+end_src

This passes several snippets of emacs-lisp for emacs to evaluate:

#+begin_src emacs-lisp
(require 'org)
#+end_src

First ensures that org-mode is loaded, then we edit the org-babel configuration slightly:

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
#+end_src

This disables the prompt before evaluating each code block so that a user doesn't have to type =yes= for each block that is evaluated.
With that config change in place it's just a matter to call the function that will actually tangle our org file and tell it which file to operate on:

#+begin_src emacs-lisp
(org-babel-tangle-file "file.org")
#+end_src

With this the org file is tangled and nobody had to open an emacs window or learn any keybindings 😅 

* Exporting

After working with org files a bunch to create this template, I discovered that there is also a fairly customizable export functionality -
by setting a few config values:

#+begin_src emacs-lisp
(setq org-html-doctype "html5")
(setq org-html-postamble-format '(("en" "<footer class=\"page-footer\">
<div class=\"container\">
  <a href=\"../index.html\">&lt;- M-x find-more-content</a>
</div>
</footer>")))
(setq org-html-postamble 't)
(setq org-html-preamble-format '(("en" "<header>
<div class=\"container\">
  <h1 class=\"glitch-text\" data-text=\"%t\">%t</h1>
  <span class=\"subtitle\">%s</span>
</div>
<div class=\"byline\">
  <div class=\"container\">
    <p>By <a href=\"https://twitter.com/chamooktweets\">Adam Guest</a> - %d</p>
  </div>
</div>
</header>")))
#+end_src

And adding some extra values to include in the html at the top of the document:

#+begin_src org
#+options: toc:nil num:nil html-style:nil html5-fancy:'t title:nil exports:both
#+html_content_class: container
#+html_head: <link rel="stylesheet" href="../style.css">
#+html_head: <meta charset="utf-8">
#+html_head:<meta http-equiv="X-UA-Compatible" content="IE=edge">
#+html_head:<meta name="viewport" content="width=device-width, initial-scale=1">
#+html_head:<link rel="apple-touch-icon" sizes="180x180" href="../apple-touch-icon.png">
#+html_head:<link rel="icon" type="image/png" sizes="32x32" href="../favicon-32x32.png">
#+html_head:<link rel="icon" type="image/png" sizes="16x16" href="../favicon-16x16.png">
#+end_src

I can use =org-export-dispatch= to generate this html page 😍 
