literate-programming-with-org/index.html

<div id="outline-container-orgfce8a14" class="outline-2">
<h2 id="orgfce8a14">Backfilling Values with Noweb</h2>
<div class="outline-text-2" id="text-orgfce8a14">
<p>
Building templates that were configurable in this way led to a scenario where sometimes I would need to include values in an earlier part of a
bicep file only if a later block was tangled. Source blocks in org mode support using <a href="https://en.wikipedia.org/wiki/Noweb">noweb</a> style markup to include either the contents
or the result of evaluating other blocks in the document, which provides a nice way of solving this problem.
</p>

<p>
In the initial block that may need a value from later, I can enable noweb replacements by specifying <code>:noweb yes</code> and then add a
reference to the later contents:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src :noweb yes</span>
<span style="text-decoration: underline;">&lt;&lt;maybe-from-later()&gt;&gt;</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>

<p>
Then later include a named block, that performs the check for the dotfile and returns a value if it is present, or an empty string otherwise:
</p>

<div class="org-src-container">
<pre class="src src-org">#name: maybe-from-later
<span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src emacs-lisp :cache no</span>
<span style="color: #8b0000; background-color: #383838;">(</span><span style="color: #4c83ff; background-color: #383838;">if</span><span style="background-color: #383838;"> </span><span style="color: #006400; background-color: #383838;">(</span><span style="background-color: #383838;">file-exists-p </span><span style="color: #61CE3C; background-color: #383838;">".config2"</span><span style="color: #006400; background-color: #383838;">)</span><span style="background-color: #383838;"> </span><span style="color: #61CE3C; background-color: #383838;">"// the file exists"</span><span style="background-color: #383838;"> </span><span style="color: #61CE3C; background-color: #383838;">""</span><span style="color: #8b0000; background-color: #383838;">)</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac6dd24" class="outline-2">
<h2 id="orgac6dd24">Tangling for the non-Emacs user</h2>
<div class="outline-text-2" id="text-orgac6dd24">
<p>
A template is less useful if it constrains people to use a specific editor (with a relatively steep learning curve) to be able to get any value from
it, but fortunately Emacs can be called from the command line to tangle a file so I included a shell script with my template. (I actually tangled
the shell script from the template itself 🤘):
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #008ED1; background-color: #2b2b2b;">#+begin_src bash :tangle tangle.sh :shebang "#!/bin/bash"</span>
<span style="background-color: #383838;">emacs --batch </span><span style="color: #61CE3C; background-color: #383838;">\</span>
<span style="background-color: #383838;">      --eval </span><span style="color: #61CE3C; background-color: #383838;">"(require 'org)"</span><span style="background-color: #383838;"> </span><span style="color: #61CE3C; background-color: #383838;">\</span>
<span style="background-color: #383838;">      --eval </span><span style="color: #61CE3C; background-color: #383838;">"(setq org-confirm-babel-evaluate nil)"</span><span style="background-color: #383838;"> </span><span style="color: #61CE3C; background-color: #383838;">\</span>
<span style="background-color: #383838;">      --eval </span><span style="color: #61CE3C; background-color: #383838;">'(org-babel-tangle-file "file.org")'</span>
<span style="color: #008ED1; background-color: #2b2b2b;">#+end_src</span>
</pre>
</div>

<p>
This passes several snippets of emacs-lisp for emacs to evaluate:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">require</span> '<span style="color: #96CBFE;">org</span><span style="color: #8b0000;">)</span>
</pre>
</div>

<p>
First ensures that org-mode is loaded, then we edit the org-babel configuration slightly:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> org-confirm-babel-evaluate nil<span style="color: #8b0000;">)</span>
</pre>
</div>

<p>
This disables the prompt before evaluating each code block so that a user doesn't have to type <code>yes</code> for each block that is evaluated.
With that config change in place it's just a matter to call the function that will actually tangle our org file and tell it which file to operate on:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span>org-babel-tangle-file <span style="color: #61CE3C;">"file.org"</span><span style="color: #8b0000;">)</span>
</pre>
</div>

<p>
With this the org file is tangled and nobody had to open an emacs window or learn any keybindings 😅 
</p>
</div>
</div>

<div id="outline-container-org7a1bd1a" class="outline-2">
<h2 id="org7a1bd1a">Exporting</h2>
<div class="outline-text-2" id="text-org7a1bd1a">
<p>
After working with org files a bunch to create this template, I discovered that there is also a fairly customizable export functionality -
by setting a few config values:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> org-html-doctype <span style="color: #61CE3C;">"html5"</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> org-html-postamble-format '<span style="color: #006400;">(</span><span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"en"</span> <span style="color: #61CE3C;">"&lt;footer class=\"page-footer\"&gt;</span>
<span style="color: #61CE3C;">&lt;div class=\"container\"&gt;</span>
<span style="color: #61CE3C;">  &lt;a href=\"../index.html\"&gt;&amp;lt;- M-x find-more-content&lt;/a&gt;</span>
<span style="color: #61CE3C;">&lt;/div&gt;</span>
<span style="color: #61CE3C;">&lt;/footer&gt;"</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> org-html-postamble 't<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> org-html-preamble-format '<span style="color: #006400;">(</span><span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"en"</span> <span style="color: #61CE3C;">"&lt;header&gt;</span>
<span style="color: #61CE3C;">&lt;div class=\"container\"&gt;</span>
<span style="color: #61CE3C;">  &lt;h1 class=\"glitch-text\" data-text=\"%t\"&gt;%t&lt;/h1&gt;</span>
<span style="color: #61CE3C;">  &lt;span class=\"subtitle\"&gt;%s&lt;/span&gt;</span>
<span style="color: #61CE3C;">&lt;/div&gt;</span>
<span style="color: #61CE3C;">&lt;div class=\"byline\"&gt;</span>
<span style="color: #61CE3C;">  &lt;div class=\"container\"&gt;</span>
<span style="color: #61CE3C;">    &lt;p&gt;By &lt;a href=\"https://twitter.com/chamooktweets\"&gt;Adam Guest&lt;/a&gt; - %d&lt;/p&gt;</span>
<span style="color: #61CE3C;">  &lt;/div&gt;</span>
<span style="color: #61CE3C;">&lt;/div&gt;</span>
<span style="color: #61CE3C;">&lt;/header&gt;"</span><span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>

<p>
And adding some extra values to include in the html at the top of the document:
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #8B8989; font-style: italic;">#+options: toc:nil num:nil html-style:nil html5-fancy:'t title:nil exports:both</span>
<span style="color: #8B8989; font-style: italic;">#+html_content_class: container</span>
<span style="color: #8B8989; font-style: italic;">#+html_head: &lt;link rel="stylesheet" href="../style.css"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head: &lt;meta charset="utf-8"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta http-equiv="X-UA-Compatible" content="IE=edge"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta name="viewport" content="width=device-width, initial-scale=1"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;link rel="apple-touch-icon" sizes="180x180" href="../apple-touch-icon.png"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;link rel="icon" type="image/png" sizes="32x32" href="../favicon-32x32.png"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;link rel="icon" type="image/png" sizes="16x16" href="../favicon-16x16.png"&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="og:url" content="<a href="https://chamook.lol/literate-programming-with-org/">https://chamook.lol/literate-programming-with-org/</a>" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="og:image" content="<a href="https://chamook.lol/literate-programming-with-org/card.png">https://chamook.lol/literate-programming-with-org/card.png</a>" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="og:type" content="article" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="article:published_time" content="2022-08-12T00:00:00+00:00" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta name="twitter:card" content="summary_large_image" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="twitter:image" content="<a href="https://chamook.lol/literate-programming-with-org/card.png">https://chamook.lol/literate-programming-with-org/card.png</a>" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="twitter:title" content="Literate Programming with Org Mode &#129412;" /&gt;</span>
<span style="color: #8B8989; font-style: italic;">#+html_head:&lt;meta property="twitter:description" content="Broke: Generate docs from code | Woke: Generate code from docs &#128526;" /&gt;</span>
</pre>
</div>

<p>
I can use <code>org-export-dispatch</code> to generate this html page 😍 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="page-footer"><div class="container"><a href="../index.html">&lt;- M-x find-more-content</a></div></footer>
</div>
</body>
</html>
